# Даны 2 числа a и b. Получить их сумму, разность и произведение

# не совсем понятна формулировка задания. Что значет "даны" и "получить". Сделал через инпут и принт...

a, b = int(input()), int(input())

summ = (a + b)
diff = (a - b)
prod = (a * b)

print(summ, diff, prod)
