# Даны числа x и y. Получить x − y / 1 + xy

# не совсем понятна формулировка задания. Что значет "даны" и "получить". Сделал через инпут и принт...

x, y = int(input()), int(input())

func = x - y / 1 + x * y

print(func)
